project/cases/experimental/0/alpha.water
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      alpha.water;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];


internalField   nonuniform List<scalar> 
797600
(
1
1
1
1
1
1
1
1
...
)
;

boundaryField
{
    bottom1
    {
        type            zeroGradient;
    }
    front
    {
        type            zeroGradient;
    }
    back
    {
        type            zeroGradient;
    }
    leftwall
    {
        type            zeroGradient;
    }
    rightwall
    {
        type            zeroGradient;
    }
    top
    {
        type            inletOutlet;
        inletValue      uniform 0;
        value           uniform 0;
    }
    ramp
    {
        type            zeroGradient;
    }
    slab
    {
        type            zeroGradient;
    }
    topStrc
    {
        type            zeroGradient;
    }
    piles
    {
        type            zeroGradient;
    }
}


// ************************************************************************* //
